# Importamos librerias

In [1]:
import pandas as pd
import numpy as np
import os
import snowflake.connector
import json
from snowflake.connector.pandas_tools import write_pandas
from datetime import datetime
from datetime import timedelta
from dateutil.relativedelta import relativedelta
pd.options.mode.chained_assignment = None

In [2]:
while True:
    try:

        f = open('credentials.json')
        data_pass = json.load(f)

        pass_ = input("INGRESAR PASSCODE:")

        ctx = snowflake.connector.connect(
            user = data_pass['snow']['USER'],
            password = data_pass['snow']['PASS'],
            account = data_pass['snow']['ACCOUNT'],
            passcode = pass_,
            database = 'SANDBOX_PLUS',
            schema = 'DWH'
        )

        cursor = ctx.cursor()

        print('Connected')

        break

    except:
        print('Incorrect Password - provide again')

Connected

# Segmentos

In [5]:
query = '''
SELECT
    DISTINCT
    SO.OFERTATA,
    SO.FECHA,
    SO.PERFIL_CLIENTE,
    SO.SOCI_SOCI_ID,
    SO.SUBCLASE,
    SUB.SUB_NAME
FROM
    SANDBOX_PLUS.DWH.SEGMENTOS_OFERTATA AS SO
    INNER JOIN MSTRDB.DWH.SUBCLASS AS SUB ON SUB.SUBCLASE = SO.SUBCLASE
WHERE
    SO.OFERTATA ILIKE '%8%'
'''

cursor.execute(query)
df = cursor.fetch_pandas_all()
df.head(2)

,OFERTATA,FECHA,PERFIL_CLIENTE,SOCI_SOCI_ID,SUBCLASE,SUB_NAME
0,Ofertata 8,2024-02-22,ABANDONADOR,969663,1800010007,NO RELLENAS
1,Ofertata 8,2024-02-22,ABANDONADOR,1370248,1800010007,NO RELLENAS

In [6]:
fecha_ofertata = df.loc[0, 'FECHA']
fecha_ofertata

datetime.date(2024, 2, 22)

In [7]:
ofertata = df.loc[0, 'OFERTATA']
ofertata

'Ofertata 8'

In [8]:
df['PERFIL_CLIENTE'].value_counts()

ABANDONADOR    353719
ACTIVO         153153
Name: PERFIL_CLIENTE, dtype: int64

# Abandonadores

In [9]:
# Clientes que en el ultimo mes no vengan a tata y tengan Score 5 en la subclase

In [10]:
abandonador = df[df['PERFIL_CLIENTE'] == 'ABANDONADOR']
abandonador['K'] = abandonador['SOCI_SOCI_ID'].astype(str) + abandonador['SUBCLASE'].astype(str)
abandonador.head(2)

,OFERTATA,FECHA,PERFIL_CLIENTE,SOCI_SOCI_ID,SUBCLASE,SUB_NAME,K
0,Ofertata 8,2024-02-22,ABANDONADOR,969663,1800010007,NO RELLENAS,9696631800010007
1,Ofertata 8,2024-02-22,ABANDONADOR,1370248,1800010007,NO RELLENAS,13702481800010007

## Impactados

### A. Vinieron a TATA

In [11]:
query = '''
SELECT
    DISTINCT FFM.SOCI_SOCI_ID
FROM
    MSTRDB.DWH.FT_FDLN_MOVIMIENTOS AS FFM
WHERE
    FFM.TIEM_DIA_ID BETWEEN '{fecha_snow}' AND DATEADD(DAY, 7, '{fecha_snow}')
    AND FFM.GEOG_LOCL_ID IN (SELECT GEOG_LOCL_ID FROM MSTRDB.DWH.LU_GEOG_LOCAL WHERE GEOG_UNNG_ID = 2)
'''

cursor.execute(query.format(fecha_snow = fecha_ofertata))
volvieron_general = cursor.fetch_pandas_all()
volvieron_general = volvieron_general[volvieron_general['SOCI_SOCI_ID'].isin(abandonador['SOCI_SOCI_ID'])]
print(volvieron_general['SOCI_SOCI_ID'].nunique())
volvieron_general.head(2)

14503

     SOCI_SOCI_ID
12        1684804
138        388988

### B. Vinieron en 2024 y consumieron alguna de las SUBCLASE

In [12]:
query = '''
SELECT
    FFM.TICKET,
    FFM.SOCI_SOCI_ID,
    SUB.SUBCLASE
FROM
    MSTRDB.DWH.FT_VENTAS AS FV
    INNER JOIN MSTRDB.DWH.FT_FDLN_MOVIMIENTOS AS FFM ON FV.TICKET = FFM.TICKET
    INNER JOIN MSTRDB.DWH.LU_ARTC_ARTICULO AS LAA ON FV.ARTC_ARTC_ID = LAA.ARTC_ARTC_ID
    INNER JOIN MSTRDB.DWH.ITEM_MASTER AS IM ON IM.ITEM = LAA.ORIN
    INNER JOIN MSTRDB.DWH.SUBCLASS AS SUB ON SUB.SUBCLASE = IM.SUBCLASE
WHERE
    SUB.SUBCLASE IN {subclases_snow}
    AND FFM.TIEM_DIA_ID BETWEEN '{fecha_snow}' AND DATEADD(DAY, 7, '{fecha_snow}')
'''

cursor.execute(query.format(
    subclases_snow = tuple(abandonador['SUBCLASE'].unique()),
    fecha_snow = fecha_ofertata
    ))
volvieron_subclase = cursor.fetch_pandas_all()

volvieron_subclase.head(2)

               TICKET  SOCI_SOCI_ID   SUBCLASE
0  202402241408266265        164067  200010002
1  202402241408266230        978610  200010002

In [13]:
print(volvieron_subclase.shape[0])
volvieron_subclase_2 = volvieron_subclase[(volvieron_subclase['SOCI_SOCI_ID'].isin(abandonador['SOCI_SOCI_ID'])) & (volvieron_subclase['SUBCLASE'].isin(abandonador['SUBCLASE']))]
print(volvieron_subclase_2.shape[0])
print(volvieron_subclase_2['SOCI_SOCI_ID'].nunique())

202618
6600
3539

In [14]:
# Compraron
resumen_vinieron_2024_2 = volvieron_subclase_2.groupby('SUBCLASE')['SOCI_SOCI_ID'].nunique().reset_index()
resumen_vinieron_2024_2.rename({'SOCI_SOCI_ID':'COMPRARON'}, axis = 1, inplace = True)

# Impactados
impactados_segm_5 = abandonador.groupby('SUBCLASE')['SOCI_SOCI_ID'].nunique().reset_index()
impactados_segm_5.rename({'SOCI_SOCI_ID':'IMPACTADOS'}, axis = 1, inplace = True)

# Consolido
resumen_vinieron_2024_2 = resumen_vinieron_2024_2.merge(impactados_segm_5, on = 'SUBCLASE', how = 'inner')
resumen_vinieron_2024_2['RATIO'] = (resumen_vinieron_2024_2['COMPRARON'] / resumen_vinieron_2024_2['IMPACTADOS'] * 100).astype(int)

resumen_vinieron_2024_2 = resumen_vinieron_2024_2.merge(df[['SUB_NAME', 'SUBCLASE']].drop_duplicates(), on = 'SUBCLASE', how = 'inner')

columns = resumen_vinieron_2024_2.columns.tolist()
new_columns = [columns[-1]] + columns[:-1]
resumen_vinieron_2024_2 = resumen_vinieron_2024_2[new_columns]

resumen_vinieron_2024_2.sort_values(by = 'RATIO', ascending = False, inplace = True)
resumen_vinieron_2024_2

,SUB_NAME,SUBCLASE,COMPRARON,IMPACTADOS,RATIO
3,NO RELLENAS,1800010007,1525,50841,2
0,AGUA CON GAS,200010001,493,48967,1
1,AGUA SIN GAS,200010002,885,49010,1
2,CANOLA,1100010002,287,53079,0
4,ARTESANALES SALADAS,1800020002,263,48376,0
5,HAMBURGUESAS VACUNA INDIVIDUAL,2900020002,360,50013,0
6,JABONES DETERGENTE LIQUIDOS PARA ROPA,8800030003,517,53433,0

In [26]:
resumen_vinieron_2024_2.loc[:, 'SUB_NAME'].iloc[:3, ]

3     NO RELLENAS
0    AGUA CON GAS
1    AGUA SIN GAS
Name: SUB_NAME, dtype: object

### Conclusiones Impactados

In [27]:
a = abandonador['SOCI_SOCI_ID'].nunique()
b = int(volvieron_general['SOCI_SOCI_ID'].nunique() / abandonador['SOCI_SOCI_ID'].nunique() * 100)
c = int(volvieron_subclase_2['SOCI_SOCI_ID'].nunique() / abandonador['SOCI_SOCI_ID'].nunique() * 100)
d = str(resumen_vinieron_2024_2.loc[:, 'SUB_NAME'].iloc[:3, ].values).replace('[', '').replace(']', '')

print(f"Los segmentos de {ofertata} fueron generados el {fecha_ofertata}")
print("")
print("---- Abandonadores")
print("")
print(f"Comprende clientes que en los ultimos 30 dias no vengan a TATA y tengan Score 4 o 5 en la subclase")
print(f"De los {a} clientes que cumplen dicho criterio, un {b}% volvieron a TATA luego del {ofertata}")
print("")
print(f"Asimismo, de los {a} clientes, un {c}% volvieron a TATA luego del {ofertata} y compraron la subclase que se les promociono, siendo {d} las mejores subclases")

Los segmentos de Ofertata 8 fueron generados el 2024-02-22

---- Abandonadores

Comprende clientes que en los ultimos 30 dias no vengan a TATA y tengan Score 4 o 5 en la subclase
De los 165793 clientes que cumplen dicho criterio, un 8% volvieron a TATA luego del Ofertata 8

Asimismo, de los 165793 clientes, un 2% volvieron a TATA luego del Ofertata 8 y compraron la subclase que se les promociono, siendo 'NO RELLENAS' 'AGUA CON GAS' 'AGUA SIN GAS' las mejores subclases

## Venta y GB1

In [28]:
query = '''
SELECT
    FFM.SOCI_SOCI_ID,
    FFM.SOCI_SOCI_ID || SUB.SUBCLASE AS K,
    SUM(FV.VNTA_IMPORTE_SIN_IVA) AS VENTAS,
    SUM(FV.VNTA_IMPORTE_SIN_IVA) - SUM(FV.VNTA_UNIDADES * FV.VNTA_COSTO_PROM_POND) AS GB1
FROM
    MSTRDB.DWH.FT_FDLN_MOVIMIENTOS AS FFM
    INNER JOIN MSTRDB.DWH.FT_VENTAS AS FV ON FV.TICKET = FFM.TICKET
    INNER JOIN MSTRDB.DWH.LU_ARTC_ARTICULO AS LAA ON LAA.ARTC_ARTC_ID = FV.ARTC_ARTC_ID
    INNER JOIN MSTRDB.DWH.ITEM_MASTER AS IM ON IM.ITEM = LAA.ORIN
    INNER JOIN MSTRDB.DWH.SUBCLASS AS SUB ON SUB.SUBCLASE = IM.SUBCLASE
WHERE
    FFM.TIEM_DIA_ID BETWEEN '{fecha_snow}' AND DATEADD(DAY, 7, '{fecha_snow}')
    AND FFM.GEOG_LOCL_ID IN (SELECT GEOG_LOCL_ID FROM MSTRDB.DWH.LU_GEOG_LOCAL WHERE GEOG_UNNG_ID = 2)
    AND SUB.SUBCLASE IN {subclases_snow}
GROUP BY
    ALL
'''

cursor.execute(query.format(
    subclases_snow = tuple(abandonador['SUBCLASE'].unique()),
    fecha_snow = fecha_ofertata
    ))
ventas_segm_5 = cursor.fetch_pandas_all()

ventas_segm_5 = ventas_segm_5[ventas_segm_5['K'].isin(abandonador['K'])]

print(f"Ventas en Miles: {int(round(ventas_segm_5['VENTAS'].sum() / 1000, 0))}")
print(f"GB1 en Miles: {int(round(ventas_segm_5['GB1'].sum() / 1000, 0))}")

Ventas en Miles: 92
GB1 en Miles: 19

# Activos

In [29]:
# Para cada categoria (subclase) son los clientes activos que no compran la subclase y tienen score 5

In [30]:
activo = df[df['PERFIL_CLIENTE'] == 'ACTIVO']
activo['K'] = activo['SOCI_SOCI_ID'].astype(str) + activo['SUBCLASE'].astype(str)

In [31]:
activo['SUBCLASE'].unique()

array([8800030003, 1800010007, 1800020002,  200010001, 1100010002,
        200010002, 2900020002], dtype=int64)

In [32]:
query = '''
SELECT
    FFM.TICKET,
    FFM.SOCI_SOCI_ID,
    SUB.SUBCLASE
FROM
    MSTRDB.DWH.FT_VENTAS AS FV
    INNER JOIN MSTRDB.DWH.FT_FDLN_MOVIMIENTOS AS FFM ON FV.TICKET = FFM.TICKET
    INNER JOIN MSTRDB.DWH.LU_ARTC_ARTICULO AS LAA ON FV.ARTC_ARTC_ID = LAA.ARTC_ARTC_ID
    INNER JOIN MSTRDB.DWH.ITEM_MASTER AS IM ON IM.ITEM = LAA.ORIN
    INNER JOIN MSTRDB.DWH.SUBCLASS AS SUB ON SUB.SUBCLASE = IM.SUBCLASE
WHERE
    FFM.TIEM_DIA_ID BETWEEN '{fecha_snow}' AND DATEADD(DAY, 7, '{fecha_snow}')
    AND SUB.SUBCLASE IN {subclases_snow}
'''

cursor.execute(query.format(
    subclases_snow = tuple(abandonador['SUBCLASE'].unique()),
    fecha_snow = fecha_ofertata
))
volvieron_subclase_segm_3 = cursor.fetch_pandas_all()

volvieron_subclase_segm_3.head(2)

              TICKET  SOCI_SOCI_ID    SUBCLASE
0  20240224884294620         48146  1800010007
1   2024022497804918        450450  1800010007

In [33]:
print(volvieron_subclase_segm_3.shape[0])
volvieron_subclase_segm_3_version_2 = volvieron_subclase_segm_3[(volvieron_subclase_segm_3['SOCI_SOCI_ID'].isin(activo['SOCI_SOCI_ID'])) & (volvieron_subclase_segm_3['SUBCLASE'].isin(activo['SUBCLASE']))]
print(volvieron_subclase_segm_3_version_2.shape[0])
print(volvieron_subclase_segm_3_version_2['SOCI_SOCI_ID'].nunique())

202618
105699
41949

In [34]:
# Compraron
volvieron_subclase_segm_3_version_2_resumen = volvieron_subclase_segm_3_version_2.groupby('SUBCLASE')['SOCI_SOCI_ID'].nunique().reset_index()
volvieron_subclase_segm_3_version_2_resumen.rename({'SOCI_SOCI_ID':'COMPRARON'}, axis = 1, inplace = True)

# Impactados
impactados_segm_3 = activo.groupby('SUBCLASE')['SOCI_SOCI_ID'].nunique().reset_index()
impactados_segm_3.rename({'SOCI_SOCI_ID':'IMPACTADOS'}, axis = 1, inplace = True)

# Consolido
volvieron_subclase_segm_3_version_2_resumen = volvieron_subclase_segm_3_version_2_resumen.merge(impactados_segm_3, on = 'SUBCLASE', how = 'inner')
volvieron_subclase_segm_3_version_2_resumen['RATIO'] = (volvieron_subclase_segm_3_version_2_resumen['COMPRARON'] / volvieron_subclase_segm_3_version_2_resumen['IMPACTADOS'] * 100).astype(int)

volvieron_subclase_segm_3_version_2_resumen = volvieron_subclase_segm_3_version_2_resumen.merge(df[['SUB_NAME', 'SUBCLASE']].drop_duplicates(), on = 'SUBCLASE', how = 'inner')

columns = volvieron_subclase_segm_3_version_2_resumen.columns.tolist()
new_columns = [columns[-1]] + columns[:-1]
volvieron_subclase_segm_3_version_2_resumen = volvieron_subclase_segm_3_version_2_resumen[new_columns]

volvieron_subclase_segm_3_version_2_resumen.sort_values(by = 'RATIO', ascending = False, inplace = True)
volvieron_subclase_segm_3_version_2_resumen

,SUB_NAME,SUBCLASE,COMPRARON,IMPACTADOS,RATIO
3,NO RELLENAS,1800010007,16679,15040,110
1,AGUA SIN GAS,200010002,13294,17743,74
0,AGUA CON GAS,200010001,8015,21875,36
5,HAMBURGUESAS VACUNA INDIVIDUAL,2900020002,7065,23060,30
6,JABONES DETERGENTE LIQUIDOS PARA ROPA,8800030003,6022,23731,25
4,ARTESANALES SALADAS,1800020002,4702,23295,20
2,CANOLA,1100010002,3818,28409,13

In [36]:
a = activo['SOCI_SOCI_ID'].nunique()
b = int(volvieron_subclase_segm_3_version_2['SOCI_SOCI_ID'].nunique() / activo['SOCI_SOCI_ID'].nunique() * 100)
c = str(volvieron_subclase_segm_3_version_2_resumen.loc[:, 'SUB_NAME'].iloc[:3, ].values).replace('[', '').replace(']', '')

print("---- Activos")
print("")
print(f"Comprende a los clientes activos que no compran la subclase y tienen score 5 en la misma")
print("")
print(f"De los {a} clientes que cumplen dicho criterio, un {b}% volvieron a TATA luego del {ofertata} y compraron la subclase que se les promociono, siendo {c} las mejores subclases")

---- Activos

Comprende a los clientes activos que no compran la subclase y tienen score 5 en la misma

De los 153153 clientes que cumplen dicho criterio, un 27% volvieron a TATA luego del Ofertata 8 y compraron la subclase que se les promociono, siendo 'NO RELLENAS' 'AGUA SIN GAS' 'AGUA CON GAS' las mejores subclases

## Venta y GB1

In [37]:
query = '''
SELECT
    FFM.SOCI_SOCI_ID,
    FFM.SOCI_SOCI_ID || SUB.SUBCLASE AS K,
    SUM(FV.VNTA_IMPORTE_SIN_IVA) AS VENTAS,
    SUM(FV.VNTA_IMPORTE_SIN_IVA) - SUM(FV.VNTA_UNIDADES * FV.VNTA_COSTO_PROM_POND) AS GB1
FROM
    MSTRDB.DWH.FT_FDLN_MOVIMIENTOS AS FFM
    INNER JOIN MSTRDB.DWH.FT_VENTAS AS FV ON FV.TICKET = FFM.TICKET
    INNER JOIN MSTRDB.DWH.LU_ARTC_ARTICULO AS LAA ON LAA.ARTC_ARTC_ID = FV.ARTC_ARTC_ID
    INNER JOIN MSTRDB.DWH.ITEM_MASTER AS IM ON IM.ITEM = LAA.ORIN
    INNER JOIN MSTRDB.DWH.SUBCLASS AS SUB ON SUB.SUBCLASE = IM.SUBCLASE
WHERE
    FFM.TIEM_DIA_ID BETWEEN '{fecha_snow}' AND DATEADD(DAY, 7, '{fecha_snow}')
    AND FFM.GEOG_LOCL_ID IN (SELECT GEOG_LOCL_ID FROM MSTRDB.DWH.LU_GEOG_LOCAL WHERE GEOG_UNNG_ID = 2)
    AND SUB.SUBCLASE IN {subclases_snow}
GROUP BY
    ALL
'''

cursor.execute(query.format(
    subclases_snow = tuple(abandonador['SUBCLASE'].unique()),
    fecha_snow = fecha_ofertata
    ))
ventas_segm_3 = cursor.fetch_pandas_all()

ventas_segm_3 = ventas_segm_3[ventas_segm_3['K'].isin(activo['K'])]

print(f"Ventas en Miles: {int(round(ventas_segm_3['VENTAS'].sum() / 1000, 0))}")
print(f"GB1 en Miles: {int(round(ventas_segm_3['GB1'].sum() / 1000, 0))}")

Ventas en Miles: 356
GB1 en Miles: 63

# Fin